onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_Боты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_омни_Боты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Токен</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Использовать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Канал</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_омни_КаналыСвязи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Enums/бит_омни_КаналыСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_омни_КаналыСвязи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>MAX</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

onec/omni/src/extension/бит_МедицинаОмни_ПРОФ/Catalogs/бит_омни_Боты/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗаполнитьИнформациюОБоте(Команда)
	ЗаполнитьИнформациюОБотеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРассылкиЗаписей(Команда)

	Если Объект.Канал <> ПредопределенноеЗначение("Перечисление.бит_омни_КаналыСвязи.MAX") Тогда
		ПоказатьПредупреждение(, НСтр("ru='Выберите канал MAX.'"));
		Возврат;
	КонецЕсли;

	Если Не Объект.Использовать Тогда
		ПоказатьПредупреждение(, НСтр("ru='Включите флаг Использовать.'"));
		Возврат;
	КонецЕсли;

	Если ПустаяСтрока(Объект.Токен) Тогда
		ПоказатьПредупреждение(, НСтр("ru='Укажите токен MAX.'"));
		Возврат;
	КонецЕсли;

	Попытка
		Записать();
		Результат = СоздатьРассылкиЗаписейНаСервере();
		ПоказатьОповещениеПользователя(СтрШаблон(
			НСтр("ru='Готово. Создано: %1, уже было: %2, активировано: %3. Существующие настройки сохранены.'"),
			Результат.Создано,
			Результат.УжеСуществовало,
			Результат.Активировано));
	Исключение
		ПоказатьПредупреждение(, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;

КонецПроцедуры

&НаСервере
Функция СоздатьРассылкиЗаписейНаСервере()

	Возврат Справочники.бит_омни_Рассылки.СоздатьСтандартныеРассылкиЗаписейMAX(Объект.Ссылка);

КонецФункции

&НаСервере
Процедура ЗаполнитьИнформациюОБотеНаСервере()
	
	Если Объект.Канал = Перечисления.бит_омни_КаналыСвязи.MAX Тогда
		ДанныеБота = бит_омни_ИнтеграцияСMAX.ИнформацияОБоте(Объект.Токен);
		Если ДанныеБота = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		Объект.Идентификатор = Формат(ДанныеБота.user_id, "ЧГ=0");
		Объект.Наименование = Лев(ПредставлениеБотаMAX(ДанныеБота), 150);
		Объект.ИмяПользователя = ИмяПользователяБотаMAX(ДанныеБота);
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеБотаMAX(ДанныеБота)
	
	Представление = "";
	Если ДанныеБота.Свойство("name", Представление) И ЗначениеЗаполнено(Представление) Тогда
		Возврат СокрЛП(Представление);
	КонецЕсли;
	
	Если ДанныеБота.Свойство("first_name", Представление) И ЗначениеЗаполнено(Представление) Тогда
		Возврат СокрЛП(Представление);
	КонецЕсли;
	
	Возврат ИмяПользователяБотаMAX(ДанныеБота);
	
КонецФункции

&НаСервереБезКонтекста
Функция ИмяПользователяБотаMAX(ДанныеБота)
	
	ИмяПользователя = "";
	Если ДанныеБота.Свойство("username", ИмяПользователя) Тогда
		Возврат СокрЛП(ИмяПользователя);
	КонецЕсли;
	
	Возврат "";
	
КонецФункции
